Тест/Тест/src/InformationRegisters/ЗаписиЗвонков/ЗаписиЗвонков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаписиЗвонков</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>URL</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </resources>
  <resources>
    <name>ТипЗвонка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>РучноеРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.дт_СостоянияЗаказовКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продажа</name>
    <type>
      <types>DocumentRef.ПродажаЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийАудитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОАудитора</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>IDКод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФИОРОКК</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийРОКК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АудитПроверен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хороший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Плохой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Техно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НетЗамечаний</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест/Тест/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированаяЧастьЗарплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьВПланировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиСогласования</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест/Тест/src/InformationRegisters/ЗаписиЗвонков/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание",  Запись.НомерТелефона);
	//ПараметрыФормы.Вставить("Клиент1С", Запись.Клиент);

		
ОткрытьФорму("Документ.заказклиента.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиента(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание",  Запись.НомерТелефона);
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДопНомер(Команда)
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборКлиента",ЭтаФорма);
	//ОткрытьФорму("");
	ОткрытьФорму("Справочник.Клиенты.ФормаВыбора",,,,,,
ОписаниеВыбора,
РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Элементы.СписокЧек.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКлиента(РезультатЗакрытия,ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
ЗаписьДопНомера(РезультатЗакрытия);
КонецПроцедуры

Процедура ЗаписьДопНомера(Результат)
	Отбор = Новый Структура();
	Отбор.Вставить("Телефон", Запись.НомерТелефона);
	ОбОбъект = Результат.ссылка.ПолучитьОбъект();
	НайденныеСтроки = ОбОбъект.ДополнительныеКонтакты.НайтиСтроки(Отбор);
	Если  НайденныеСтроки.Количество() = 0 тогда
		НоваяСтрока = ОбОбъект.ДополнительныеКонтакты.Добавить();
		НоваяСтрока.Телефон = Запись.НомерТелефона;
		ОбОбъект.Записать();
	КонецЕсли;
МассивПараметров = Новый Массив;
МассивПараметров.Добавить(строка(Запись.НомерТелефона));

ФоновыеЗадания.Выполнить("МоиЗвонкиИЗаявки.ПолучитьТаблицуЗвонковПоНомеруТелефонаОбр",МассивПараметров,Новый УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Запись.РучноеРедактирование = Истина;
	Если ЗначениеЗаполнено(Запись.ФИОРОКК) Тогда
		Запись.АудитПроверен = Истина;
	Иначе
		Запись.АудитПроверен = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	Запись.Сумма        = ПолучитьСумму();
	Запись.СтатусЗаявки = ПолучитьСтатусЗаявки();
КонецПроцедуры

Функция ПолучитьСумму()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"СуммаДокумента");
КонецФункции

Функция ПолучитьСтатусЗаявки()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"Состояние");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 25.01.2023
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Доступно = Ложь;
	Если ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Карпова Екатерина Николаевна") ИЛИ 
		 ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Шлеенкова Виктория Алексеевна") Тогда
		Доступно = Истина;
	КонецЕсли;
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("дт_ПолныеПрава")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("ПолныеПрава")) ИЛИ 
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("Руководитель")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("Контролёр")) ИЛИ
		 Доступно Тогда
		Элементы.КомментарийАудитора.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.КомментарийАудитора.ТолькоПросмотр = Истина;
	КонецЕсли;
	///-ГомзМА 25.01.2023
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("дт_ПолныеПрава")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("ПолныеПрава")) Тогда
		 Элементы.РучноеРедактирование.ТолькоПросмотр = Ложь;
	 Иначе
		 Элементы.РучноеРедактирование.ТолькоПросмотр = Истина;
	КонецЕсли;

	Элементы.КомментарийАудитора.ПодсказкаВвода = "Обращение:" + Символы.пс + "Замечание:" + Символы.ПС + "Комментарий:" + Символы.ПС + "Рекомендация:";
	
	Если ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Карпова Екатерина Николаевна") Тогда
		Элементы.КомментарийРОКК.ТолькоПросмотр = Ложь;
		Элементы.ФИОРОКК.ТолькоПросмотр 		= Ложь;
		Элементы.АудитПроверен.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.КомментарийРОКК.ТолькоПросмотр = Истина;
		Элементы.ФИОРОКК.ТолькоПросмотр 		= Истина;
		Элементы.АудитПроверен.ТолькоПросмотр 	= Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура КомментарийАудитораПриИзмененииНаСервере()
Запись.ФИОАудитора = Пользователи.ТекущийПользователь();

КонецПроцедуры

&НаКлиенте
Процедура КомментарийАудитораПриИзменении(Элемент)
	КомментарийАудитораПриИзмененииНаСервере();
	//Запись.РучноеРедактирование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	///+ГомзМА 07.03.2023
	Если Запись.НомерТелефона = "Unknown" Тогда
		Элементы.НомерТелефона.ТолькоПросмотр 	= Ложь;
		Элементы.НомерТелефона.Маска 			= "+7 999 999-99-99";
	Иначе
		Элементы.НомерТелефона.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Запись.Клиент.Пустая() Тогда
		Элементы.Клиент.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.Клиент.ТолькоПросмотр 	= Истина;
	КонецЕсли;
	///-ГомзМА 07.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	
	Запись.РучноеРедактирование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Запись.РучноеРедактирование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Запись.РучноеРедактирование = Истина;
КонецПроцедуры

&НаСервере
Процедура КомментарийРОККПриИзмененииНаСервере()
	
	///+ГомзМА 21.04.2023
	Запись.ФИОРОКК = Пользователи.ТекущийПользователь();
	///-ГомзМА 21.04.2023
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРОККПриИзменении(Элемент)
	КомментарийРОККПриИзмененииНаСервере();
КонецПроцедуры
